# HasStarted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transaction..::..HasStarted Method
Transaction Class See Also
---
Determines whether the transaction has been started yet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasStarted()
```

Visual Basic
---
```text
Public Function HasStarted As Boolean
```

Visual C++
---
```text
public:
bool HasStarted()
```

# ### Return Value
True if the transaction has already started, False otherwise.
# Remarks
A transaction is considered being started after a 'Start' method was called and until the transaction is either completely committed or rolled back.
HasStarted may return True even after 'Commit' or 'RollBack' was called if the method returned the TransactionStatus.Pending value.
A transaction can only be Started when HasStarted returns false.
# See Also
Transaction Class
Autodesk.Revit.DB Namespace